/*
  Упражнение № 1: Заказ пиццы

  Вам предоставлены цены на соответствующие пиццы в виде Map:

  const pizzaPrices = {
  'Venice': 289,
  'Double Cheese': 359,
  'Roman Margherita': 299,
  };

  Напишите программу для расчета суммы заказа.

  Например, при следующем заказе:

  const myOrder = ['Venice', 'Double Cheese', 'Roman Margherita'];

  Программа должна напечатать:

  Заказано 3 пиццы из 3 на сумму: 947 рублей

  Под задача № 1: если пиццы нет в меню, то программа должна сообщить об этом.

  Заказано 2 пиццы из 3 на сумму: 648рублей
  Roman Margherita нет в меню

  Под задача № 2: вам поступила новая пицца Pepperoni стоимостью 199 руб., добавьте ее в карту pizzaPrice.
  И распечатайте все меню.

  Под задача № 3: Отсортируйте карту по ключам и выведите отсортированное меню на экран.
  Примечание: Для сортировки можете воспользоваться SplayTreeMap.
*/

void main() {
  const pizzaPrices = {
    'Venice': 289,
    'Double Cheese': 359,
    'Roman Margherita': 299,
  };
}
